function f = yueshu1(x,x0)%手数(行向量)和无风险比例
global S  p%投资总金额,各种股票价格
miu0 = 0.001;%交易成本系数
%x0  = (S - 100*sum(x'.*p))/S; %无风险投资比例
C0=miu0*x0*S; %无风险投资的交易费用
k0 = 5; %风投委托费


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%k1:第i中股票交易手数为n(i)时的交易佣金
miu1=0.003; %佣金成本系数
%kl = [];
for i = 1:size(x')
if(100*miu1*x(i)*p(i)<=5)
    k1(i) =5;
else
    k1(i)=100*miu1*x(i)*p(i);
end

%k2:第i 种股票交易手数为ni时的过户费
miu2 = 0.001; %每股股票过户费的成本系数
if(100*miu2*x(i)<=1)
    k2(i) = 1;
else
    k2(i) = 100*miu2.*x(i);
end
c  = k0 + k1(i) + k2(i);%第i种股票交易手数为ni时的交易成本
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


%cz = sum(c) %风险投资的总交易成本
C = C0 + sum(c);%投资组合总交易费用
%n(i):第i 种股票的交易手数为
%p(i)第i中股票的每股价格
%r(i)第i中股票的收益率
global r
r_w = 0.0385;%无风险投资利率
global yuqi_shou
%R0 = 0.1;%T时刻预期收益率
R0 = yuqi_shou;
f = S*R0 + C - r_w*x0*S -  100*sum(x.*p.*r);

end
